In [39]:
# Dependencies and Setup
import pandas as pd

# Create path to data files
data_path = 'data/LTS CHURN CASE STUDY_Updated.xlsx'

In [40]:
# Read the Job Slots dataset using the openpyxl library
data_df = pd.read_excel(data_path, engine = 'openpyxl')
data_df.head()

,COMPANY,DATE,JOB_ID,JOB_FUNCTION,JOB_REGION,JOB_IMPRESSIONS,JOB_VIEWS,JOB_APPLICATIONS,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,Company_ABC,2019-01-01,4022.0,Marketing,Asia Pacific,240.0,9.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0
1,Company_ABC,2019-01-01,6211.0,Human Resources,Latin America,203.0,9.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0
2,Company_ABC,2019-01-01,4538.0,Engineering,Europe,119.0,3.0,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0
3,Company_ABC,2019-01-02,2583.0,Support,Asia Pacific,687.0,1.0,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0
4,Company_ABC,2019-01-02,3266.0,Human Resources,North America,314.0,16.0,8.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0

In [41]:
# Get the dimensions, number of rows and columns, of the DataFrame
data_df.shape

(36484, 19)

In [42]:
# Count non-NA cells in each column
data_df.count()

COMPANY             22979
DATE                22979
JOB_ID              22979
JOB_FUNCTION        22979
JOB_REGION          22979
JOB_IMPRESSIONS     22979
JOB_VIEWS           22979
JOB_APPLICATIONS    22979
Unnamed: 8              0
Unnamed: 9              0
Unnamed: 10             0
Unnamed: 11             0
Unnamed: 12             0
Unnamed: 13             0
Unnamed: 14             0
Unnamed: 15             0
Unnamed: 16          1506
Unnamed: 17          1506
Unnamed: 18          1506
dtype: int64

In [43]:
# Remove empty rows
data_v2_df = data_df[data_df['COMPANY'].notna()]

# Remove empty columns
data_clean_df = data_v2_df.drop(data_v2_df.filter(regex = 'Unnamed').columns, axis = 1)

In [44]:
# Count non-NA cells in each column
data_clean_df.count()

COMPANY             22979
DATE                22979
JOB_ID              22979
JOB_FUNCTION        22979
JOB_REGION          22979
JOB_IMPRESSIONS     22979
JOB_VIEWS           22979
JOB_APPLICATIONS    22979
dtype: int64

In [45]:
# Add a Year column and extract values from the Date column
# data_clean_df['Year'] = pd.to_datetime(data_clean_df['DATE']).dt.to_period('Y')
data_clean_df['Year'] = pd.DatetimeIndex(data_clean_df['DATE']).year
data_clean_df.head()

,COMPANY,DATE,JOB_ID,JOB_FUNCTION,JOB_REGION,JOB_IMPRESSIONS,JOB_VIEWS,JOB_APPLICATIONS,Year
0,Company_ABC,2019-01-01,4022.0,Marketing,Asia Pacific,240.0,9.0,1.0,2019
1,Company_ABC,2019-01-01,6211.0,Human Resources,Latin America,203.0,9.0,1.0,2019
2,Company_ABC,2019-01-01,4538.0,Engineering,Europe,119.0,3.0,3.0,2019
3,Company_ABC,2019-01-02,2583.0,Support,Asia Pacific,687.0,1.0,3.0,2019
4,Company_ABC,2019-01-02,3266.0,Human Resources,North America,314.0,16.0,8.0,2019

In [46]:
# Check the data types in the DataFrame
data_clean_df.dtypes

COMPANY                     object
DATE                datetime64[ns]
JOB_ID                     float64
JOB_FUNCTION                object
JOB_REGION                  object
JOB_IMPRESSIONS            float64
JOB_VIEWS                  float64
JOB_APPLICATIONS           float64
Year                         int64
dtype: object

## Number of Jobs Posted

In [47]:
# Count of Job Postings per year
year_cnt = data_clean_df.groupby(['Year'])['Year'].count()
year_cnt

Year
2019    11199
2020    11753
2021       27
Name: Year, dtype: int64

In [48]:
# Filter data for records in 2021
data_2021_df = data_clean_df[data_clean_df['Year']==2021]
cnt_2021 = data_2021_df.groupby(['DATE'])['DATE'].count()
cnt_2021

# df = dataset_df
# df['MonthYear'] = pd.to_datetime(df['DATE']).dt.to_period('M')
# yr_2021_df = df[(df['Year'] == '2021')]
# yr_2021_df = yr_2021_df.groupby(['DATE']).count()
# yr_2021_df

DATE
2021-01-01    27
Name: DATE, dtype: int64

In [49]:
# Filter data for records on Jan 1st
jan_01_df = data_clean_df[(data_clean_df['DATE'] == '2019-01-01')|(data_clean_df['DATE'] == '2020-01-01')|(data_clean_df['DATE'] == '2021-01-01')]
jan_01_cnt = jan_01_df.groupby(['Year'])['DATE'].count()
jan_01_cnt

Year
2019     3
2020    57
2021    27
Name: DATE, dtype: int64

In [50]:
# # Filter data for records in January
# jan_df = df[(df['MonthYear'] == '2019-01')|(df['MonthYear'] == '2020-01')|(df['MonthYear'] == '2021-01')]
# jan_grouped = jan_df.groupby(['Year'])['JOB_APPLICATIONS'].count()
# jan_grouped

In [51]:
# Create a DataFrame that excludes data from 2021
dataset_df = data_clean_df[data_clean_df['Year']<2021]
dataset_df

,COMPANY,DATE,JOB_ID,JOB_FUNCTION,JOB_REGION,JOB_IMPRESSIONS,JOB_VIEWS,JOB_APPLICATIONS,Year
0,Company_ABC,2019-01-01,4022.0,Marketing,Asia Pacific,240.0,9.0,1.0,2019
1,Company_ABC,2019-01-01,6211.0,Human Resources,Latin America,203.0,9.0,1.0,2019
2,Company_ABC,2019-01-01,4538.0,Engineering,Europe,119.0,3.0,3.0,2019
3,Company_ABC,2019-01-02,2583.0,Support,Asia Pacific,687.0,1.0,3.0,2019
4,Company_ABC,2019-01-02,3266.0,Human Resources,North America,314.0,16.0,8.0,2019
...,...,...,...,...,...,...,...,...,...
22947,Company_ABC,2020-12-31,199.0,Marketing,North America,1191.0,20523.0,12.0,2020
22948,Company_ABC,2020-12-31,19885.0,Support,North America,760.0,1.0,2881.0,2020
22949,Company_ABC,2020-12-31,18211.0,Finance,Europe,750.0,12.0,101.0,2020
22950,Company_ABC,2020-12-31,8028.0,Marketing,North America,520.0,2653.0,61.0,2020
22951,Company_ABC,2020-12-31,16561.0,Sales,Asia Pacific,431.0,1.0,1.0,2020

In [52]:
# Count the number of job postings per region
region_group_df = dataset_df.groupby(['JOB_REGION']).count()

# Pull values in first column and rename columns in new DataFrame
regional_cnt_df = pd.DataFrame(region_group_df.iloc[:, 0])
regional_cnt_df.rename(columns  = {"COMPANY":"Total Postings"}, inplace = True)
regional_cnt_df

               Total Postings
JOB_REGION
Asia Pacific             5877
Europe                   5640
Latin America            5852
North America            5583

In [53]:
# Count the number of job postings per region
region_yr_df = dataset_df.groupby(['JOB_REGION', 'Year']).count()

# Pull values in first column and rename columns in new DataFrame
reg_yr_cnt_df = pd.DataFrame(region_yr_df.iloc[:, 0])
reg_yr_cnt_df.rename(columns  = {"COMPANY":"Total Postings"}, inplace = True)
reg_yr_cnt_df

                    Total Postings
JOB_REGION    Year
Asia Pacific  2019            2910
              2020            2967
Europe        2019            2754
              2020            2886
Latin America 2019            2873
              2020            2979
North America 2019            2662
              2020            2921

In [54]:
# Count the number of job postings per job function
dept_group_df = dataset_df.groupby(['JOB_FUNCTION']).count()

# Pull values in first column and rename columns in new DataFrame
dept_cnt_df = pd.DataFrame(dept_group_df.iloc[:, 0])
dept_cnt_df.rename(columns  = {"COMPANY":"Total Postings"}, inplace = True)
dept_cnt_df.sort_values(by = ['Total Postings'], ascending = False, inplace = True)
dept_cnt_df

                 Total Postings
JOB_FUNCTION
Engineering                3167
Human Resources            3028
Marketing                  3019
Operations                 2898
Support                    2839
Sales                      2761
IT                         2625
Finance                    2615

In [55]:
dept_year_df= dataset_df.groupby(['JOB_FUNCTION', 'Year']).count()
dept_year_df= pd.DataFrame(dept_year_df['COMPANY'])
dept_year_df.rename(columns  = {"COMPANY":"Total Postings"}, inplace = True)
dept_year_df

                      Total Postings
JOB_FUNCTION    Year
Engineering     2019            1551
                2020            1616
Finance         2019            1282
                2020            1333
Human Resources 2019            1478
                2020            1550
IT              2019            1270
                2020            1355
Marketing       2019            1464
                2020            1555
Operations      2019            1414
                2020            1484
Sales           2019            1348
                2020            1413
Support         2019            1392
                2020            1447

## Job Applications Analysis

In [73]:
# Average Job Impressions, Job Views, and Job Applications by year per job posting
avg_yr_df= dataset_df.groupby(['Year'])[['JOB_IMPRESSIONS', 'JOB_VIEWS', 'JOB_APPLICATIONS']].mean().round(2)
avg_yr_df

      JOB_IMPRESSIONS  JOB_VIEWS  JOB_APPLICATIONS
Year
2019         26738.60    1010.79            254.57
2020         21576.57    1204.09            387.60

In [57]:
# Postings with no applications
no_apps_df = dataset_df[dataset_df['JOB_APPLICATIONS']<1]
no_apps_df.reset_index(inplace = True)
no_apps_df

,index,COMPANY,DATE,JOB_ID,JOB_FUNCTION,JOB_REGION,JOB_IMPRESSIONS,JOB_VIEWS,JOB_APPLICATIONS,Year
0,101,Company_ABC,2019-02-05,3070.0,Operations,Asia Pacific,83.0,32.0,0.0,2019
1,136,Company_ABC,2019-02-17,4045.0,Finance,Europe,664.0,3.0,0.0,2019
2,220,Company_ABC,2019-03-04,1133.0,Support,Latin America,182.0,11.0,0.0,2019
3,389,Company_ABC,2019-04-02,5343.0,Human Resources,North America,141.0,13.0,0.0,2019
4,395,Company_ABC,2019-04-03,5552.0,IT,Latin America,253.0,40.0,0.0,2019
5,433,Company_ABC,2019-04-09,2298.0,Marketing,Europe,117.0,8.0,0.0,2019
6,1088,Company_ABC,2019-06-08,2577.0,IT,North America,558.0,74.0,0.0,2019
7,15869,Company_ABC,2020-03-30,11519.0,Human Resources,Europe,285.0,19.0,0.0,2020
8,17348,Company_ABC,2020-05-07,7681.0,Finance,Europe,8010.0,430.0,0.0,2020
9,17355,Company_ABC,2020-05-07,15316.0,Finance,Latin America,3272.0,297.0,0.0,2020
10,17358,Company_ABC,2020-05-07,8180.0,Human Resources,Asia Pacific,2608.0,207.0,0.0,2020
11,17364,Company_ABC,2020-05-07,18886.0,Marketing,Latin America,1023.0,82.0,0.0,2020
12,17368,Company_ABC,2020-05-07,1118.0,IT,Asia Pacific,923.0,64.0,0.0,2020
13,17377,Company_ABC,2020-05-08,1686.0,Sales,Asia Pacific,6.0,132.0,0.0,2020
14,18919,Company_ABC,2020-07-20,10087.0,Human Resources,Latin America,107869.0,78.0,0.0,2020

In [58]:
# Average Job Impressions, Job Views, and Job Applications by Job Function per job posting
avg_df= dataset_df.groupby(['JOB_FUNCTION'])[['JOB_IMPRESSIONS', 'JOB_VIEWS', 'JOB_APPLICATIONS']].mean()
avg_df

                 JOB_IMPRESSIONS    JOB_VIEWS  JOB_APPLICATIONS
JOB_FUNCTION
Engineering         24870.199874  1075.681402        338.415219
Finance             23749.962906  1156.230210        301.001147
Human Resources     21666.797226  1140.014201        326.824306
IT                  23633.553905  1135.993143        362.705524
Marketing           23402.610467  1201.161643        316.399139
Operations          26603.736715   995.638371        305.825397
Sales               24947.776530  1078.691054        322.312930
Support             23912.965129  1098.055653        308.016203

In [80]:
avg_fx_df= dataset_df.groupby(['Year','JOB_FUNCTION'])[['JOB_IMPRESSIONS', 'JOB_VIEWS', 'JOB_APPLICATIONS']].mean().round(2)
# avg_fx_df= dataset_df.groupby(['Year','JOB_FUNCTION']).mean().round(2)
avg_fx_df['apps_per_view'] = (avg_fx_df['JOB_APPLICATIONS']/avg_fx_df['JOB_VIEWS'])*100
avg_fx_df.round(2)

                      JOB_IMPRESSIONS  JOB_VIEWS  JOB_APPLICATIONS  \
Year JOB_FUNCTION
2019 Engineering             26704.65     987.02            290.64
     Finance                 27011.45    1075.78            209.11
     Human Resources         25241.74     929.04            243.70
     IT                      25461.71    1140.86            269.25
     Marketing               26561.09    1091.25            286.83
     Operations              28357.96    1031.38            241.05
     Sales                   27664.71     918.90            245.46
     Support                 26924.37     928.98            243.04
2020 Engineering             23109.54    1160.78            384.27
     Finance                 20613.26    1233.60            389.38
     Human Resources         18257.91    1341.19            406.09
     IT                      21920.08    1131.43            450.29
     Marketing               20428.97    1304.64            344.24
     Operations              24932.26     961.58            367.54
     Sales                   22355.83    1231.13            395.63
     Support                 21016.02    1260.70            370.53

                      apps_per_view
Year JOB_FUNCTION
2019 Engineering              29.45
     Finance                  19.44
     Human Resources          26.23
     IT                       23.60
     Marketing                26.28
     Operations               23.37
     Sales                    26.71
     Support                  26.16
2020 Engineering              33.10
     Finance                  31.56
     Human Resources          30.28
     IT                       39.80
     Marketing                26.39
     Operations               38.22
     Sales                    32.14
     Support                  29.39